Tekla Open API Reference for Tekla Structures 2025
Operation.CreateConicalBentPlateByFaces Method
Overload List
Name | Description
CreateConicalBentPlateByFaces(Part, IList<Point>, Part, IList<Point>, Double, Double)
 Modifies the first plate by adding a conical bend that connects it to the second plate creating a new BentPlate instance based on two parts, selected faces in each part and radius. This method can change GUID when using from plug-ins. To keep GUID, use AddLeg(ConnectiveGeometry, LineSegment, ConnectiveGeometry, LineSegment, Double).
CreateConicalBentPlateByFaces(Part, Face, Part, Face, Double, Double)
 Modifies the first plate by adding a conical bend that connects it to the second plate creating a new BentPlate instance based on two parts and selected faces in each part, and the largest radius of the conical section and the cone aperture. This method can change GUID when using from plug-ins. To keep GUID, use AddLeg(ConnectiveGeometry, LineSegment, ConnectiveGeometry, LineSegment, Double).
Top
See Also
Reference
Operation Class
Tekla.Structures.Model.Operations Namespace